# "Сегодня мы будем работать с цифрами. А именно - писать число прописью :)
# Задача очень простая, пишем на вход функцию, куда можно передать число от нуля до одного миллиарда.
# Функция должна написать прописью это число.
# Например - передали 1,344,321
# Ответ - Один миллион, триста сорок четыре тысячи, триста двадцать один"


class NumWord:

    @staticmethod
    def num_in_word(num):
        pass


def main(num):
    NumWord.num_in_word(num)


if __name__ == '__main__':
    main(1_234_555)
